docs/posts/2016-06-08-formatting-poetry.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 25, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Formatting Poetry</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Formatting Poetry</h1>
<p class="subtitle" role="doc-subtitle">Jun 08, 2016</p>
</header><p>
I have been browsing <a href="http://jekyllrb.com/">Jekyll</a> themes lately,
and found a very nice theme for academics, the <a href="http://elotroalex.github.io/ed/documentation/#bibliographies">Ed. Theme</a>. Its main purpose seems to be publishing classic texts and poetry on the web, and it includes some very handy tools.
</p>

<p>
Getting indentation right is a problem with poetry on the web. For example, consider these lines from &ldquo;The Code—Heroics&rdquo; by Robert Frost.
</p>

<p>
Here is the Markdown source:
</p>


<pre class="example" id="org8bb1098">
What was there wrong?
		     Something you said just now.
What did I say?
	       About our taking pains.


Even though it contains the proper indentation, it renders like this:

What was there wrong?
		     Something you said just now.
What did I say?
	       About our taking pains.
</pre>

<p>
Now, stripping out extra whitespace is generally a good thing, but I don&rsquo;t want it to happen with poetry. With help from the CSS in the .Ed theme, I can get the indentation right.
</p>


<pre class="example" id="orgb76d087">
- What was there wrong?
- {:.indent-10}Something you said just now.
- What did I say?
- {:.indent-6}About our taking pains.
{:.poetry}
</pre>


<p>
Ed. sets poetry as an unordered list, with each line as a list item. List style is set to &ldquo;none&rdquo; and the indented lines contain an &ldquo;indent-x&rdquo; attribute. This produces these properly indented lines:
</p>

<pre class="example" id="orgb75e711">
- What was there wrong?
- {:.indent-10}Something you said just now.
- What did I say?
- {:.indent-65}About our taking pains.
{:.poetry}
</pre>

<p>
Ed. also contains formatting tools for bibliographies. It&rsquo;s built on <a href="https://github.com/poole/lanyon">Lanyon</a>, the theme that I use, so it was easy for me to just add the CSS that I wanted to my existing site.
</p>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 25, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
